src/logistics/Documents/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Заявка</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логист</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Водители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тягач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тягачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прицепы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузка_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Загрузка_Пункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгрузка_Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгрузка_Пункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаявкиБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИсполнителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИсполнителяБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧистаяДельта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СальдоКонечное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительБезНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДСИсполнителя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявкиБП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбменаБП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БухгалтерскиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторБП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтправкаДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрекНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОтправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьОтправления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОтправки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Дебиторка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСледующего</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторБП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/logistics/Documents/Заявка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыгрузитьЗаявку(Команда)

    Если Не Записать() Тогда
        Возврат;
    КонецЕсли;

    ТекстJSON = СформироватьJSONЗаявкиНаСервере();

    Диалог = Новый ДиалогВыбораФайла(
        РежимДиалогаВыбораФайла.Сохранение);

    Диалог.Заголовок = "Сохранить заявку для Бухгалтерии";
    Диалог.Фильтр = "Файлы JSON (*.json)|*.json";
    Диалог.ПолноеИмяФайла =
        "Заявка_" + СокрЛП(Объект.Номер) + ".json";
    Диалог.МножественныйВыбор = Ложь;

    Оповещение = Новый ОписаниеОповещения(
        "ПослеВыбораФайлаЗаявки",
        ЭтотОбъект,
        ТекстJSON);

    Диалог.Показать(Оповещение);

КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайлаЗаявки(
    ВыбранныеФайлы, ТекстJSON) Экспорт

    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    ИмяФайла = ВыбранныеФайлы[0];

    ТекстовыйФайл = Новый ТекстовыйДокумент;
    ТекстовыйФайл.УстановитьТекст(ТекстJSON);
    ТекстовыйФайл.Записать(
        ИмяФайла, КодировкаТекста.UTF8);

    Сообщить("Заявка выгружена: " + ИмяФайла);

КонецПроцедуры


&НаСервере
Функция СформироватьJSONЗаявкиНаСервере()

    Заявка = Объект.Ссылка.ПолучитьОбъект();

    ДанныеЗаявки = Новый Структура;
    ДанныеЗаявки.Вставить(
        "Идентификатор",
        Строка(Заявка.Ссылка.УникальныйИдентификатор()));

    ДанныеЗаявки.Вставить("Номер", Заявка.Номер);
    ДанныеЗаявки.Вставить(
        "Дата", ЗначениеДляJSON(Заявка.Дата));

    // Собираем реквизиты документа:
    // суммы, даты, заказчика, договор, маршрут и транспорт.
    РеквизитыЗаявки = Новый Структура;

    Для Каждого Реквизит Из Заявка.Метаданные().Реквизиты Цикл

        РеквизитыЗаявки.Вставить(
            Реквизит.Имя,
            ЗначениеДляJSON(Заявка[Реквизит.Имя]));

    КонецЦикла;

    ДанныеЗаявки.Вставить("Реквизиты", РеквизитыЗаявки);

    // Данные, которые ведутся в логистике.
    ТабличныеЧасти = Новый Структура;

    Для Каждого ОписаниеТаблицы
        Из Заявка.Метаданные().ТабличныеЧасти Цикл

        // Эти таблицы будут приходить из Бухгалтерии
        // в обратном направлении обмена.
        Если ОписаниеТаблицы.Имя = "Оплаты"
            Или ОписаниеТаблицы.Имя = "БухгалтерскиеДокументы" Тогда
            Продолжить;
        КонецЕсли;

        СтрокиТаблицы = Новый Массив;

        Для Каждого СтрокаТаблицы
            Из Заявка[ОписаниеТаблицы.Имя] Цикл

            ДанныеСтроки = Новый Структура;

            Для Каждого РеквизитКолонки
                Из ОписаниеТаблицы.Реквизиты Цикл

                ДанныеСтроки.Вставить(
                    РеквизитКолонки.Имя,
                    ЗначениеДляJSON(
                        СтрокаТаблицы[РеквизитКолонки.Имя]));

            КонецЦикла;

            СтрокиТаблицы.Добавить(ДанныеСтроки);

        КонецЦикла;

        ТабличныеЧасти.Вставить(
            ОписаниеТаблицы.Имя, СтрокиТаблицы);

    КонецЦикла;

    ДанныеЗаявки.Вставить(
        "ТабличныеЧасти", ТабличныеЧасти);

    Пакет = Новый Структура;
    Пакет.Вставить("ВерсияФормата", 1);
    Пакет.Вставить("Направление", "ЛогистикаВБухгалтерию");
    Пакет.Вставить("Заявка", ДанныеЗаявки);

    Запись = Новый ЗаписьJSON;
    Запись.УстановитьСтроку();
    ЗаписатьJSON(Запись, Пакет);

    Возврат Запись.Закрыть();

КонецФункции

&НаСервереБезКонтекста
Функция ЗначениеДляJSON(Значение)

    ТипЗначения = ТипЗнч(Значение);

    Если ТипЗначения = Тип("Строка")
        Или ТипЗначения = Тип("Число")
        Или ТипЗначения = Тип("Булево") Тогда

        Возврат Значение;
    КонецЕсли;

    Если ТипЗначения = Тип("Дата") Тогда

        Если Не ЗначениеЗаполнено(Значение) Тогда
            Возврат Неопределено;
        КонецЕсли;

        Возврат Формат(Значение, "ДФ=yyyy-MM-dd'T'HH:mm:ss");

    КонецЕсли;

    Если Не ЗначениеЗаполнено(Значение) Тогда
        Возврат Неопределено;
    КонецЕсли;

    Если Справочники.ТипВсеСсылки().СодержитТип(ТипЗначения) Тогда

        ДанныеСсылки = Новый Структура;

        ДанныеСсылки.Вставить(
            "Справочник",
            Значение.Метаданные().Имя);

        ДанныеСсылки.Вставить(                                       
            "Идентификатор",
            Строка(Значение.УникальныйИдентификатор()));

        ДанныеСсылки.Вставить(
            "Наименование",
            Строка(Значение));

        Возврат ДанныеСсылки;

    КонецЕсли;

    ВызватьИсключение
        "Не настроена выгрузка типа: " + Строка(ТипЗначения);

КонецФункции


&НаКлиенте
Процедура ЗагрузитьРезультатИзJSON(Команда)

    Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
        Сообщить("Откройте сохранённую заявку, выгруженную в Бухгалтерию.");
        Возврат;
    КонецЕсли;

    Диалог = Новый ДиалогВыбораФайла(
        РежимДиалогаВыбораФайла.Открытие);

    Диалог.Заголовок = "Выберите результат из Бухгалтерии";
    Диалог.Фильтр = "Файлы JSON (*.json)|*.json";
    Диалог.МножественныйВыбор = Ложь;

    Оповещение = Новый ОписаниеОповещения(
        "ОбменБП_ПослеВыбораФайла",
        ЭтотОбъект);

    Диалог.Показать(Оповещение);

КонецПроцедуры


&НаКлиенте
Процедура ОбменБП_ПослеВыбораФайла(
    ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Если ВыбранныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    Попытка

        ТекстовыйФайл = Новый ТекстовыйДокумент;
        ТекстовыйФайл.Прочитать(
            ВыбранныеФайлы[0],
            КодировкаТекста.UTF8);

        Результат = ОбменБП_ЗагрузитьНаСервере(
            ТекстовыйФайл.ПолучитьТекст());

        Модифицированность = Истина;
        Сообщить(Результат);

    Исключение

        Сообщить("Загрузка не выполнена: " + ОписаниеОшибки());

    КонецПопытки;

КонецПроцедуры


&НаСервере
Функция ОбменБП_ЗагрузитьНаСервере(ТекстJSON)

    Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(ТекстJSON);
    Пакет = ПрочитатьJSON(Чтение);
    Чтение.Закрыть();

    Если ТипЗнч(Пакет) <> Тип("Структура") Тогда
        ВызватьИсключение "Неверная структура файла.";
    КонецЕсли;

    Если Пакет.ВерсияФормата <> 1 Тогда
        ВызватьИсключение "Поддерживается версия формата 1.";
    КонецЕсли;

    Если Пакет.Направление <> "БухгалтерияВЛогистику" Тогда
        ВызватьИсключение "Выбран файл другого направления обмена.";
    КонецЕсли;

    Если Пакет.РежимПередачи <> "ПолныйСнимок" Тогда
        ВызватьИсключение "Ожидается полный снимок данных.";
    КонецЕсли;

    Данные = Пакет.Заявка;
    ДокументЗаявки = РеквизитФормыВЗначение("Объект");

    ИдентификаторЛогистики = Строка(
        Новый УникальныйИдентификатор(
            Данные.ИдентификаторЛогистики));

    ТекущийИдентификатор = Строка(
        ДокументЗаявки.Ссылка.УникальныйИдентификатор());

    Если ИдентификаторЛогистики <> ТекущийИдентификатор Тогда

        ВызватьИсключение
            "Файл относится к другой заявке. "
            + "Номер заявки логистики в файле: "
            + Данные.НомерЗаявкиЛогистики;

    КонецЕсли;

    ИдентификаторБП = Строка(
        Новый УникальныйИдентификатор(
            Данные.ИдентификаторБП));

    Если ЗначениеЗаполнено(
        ДокументЗаявки.ИдентификаторЗаявкиБП) Тогда

        Если ДокументЗаявки.ИдентификаторЗаявкиБП
            <> ИдентификаторБП Тогда

            ВызватьИсключение
                "Заявка уже связана с другим документом Бухгалтерии.";

        КонецЕсли;

    КонецЕсли;

    ДатаВыгрузки = ОбменБП_ДатаИзСтроки(Пакет.ДатаВыгрузки);

    Если Не ЗначениеЗаполнено(ДатаВыгрузки) Тогда
        ВызватьИсключение "В файле не заполнена дата выгрузки.";
    КонецЕсли;

    Если ЗначениеЗаполнено(ДокументЗаявки.ДатаОбменаБП) Тогда

        Если ДатаВыгрузки < ДокументЗаявки.ДатаОбменаБП Тогда

            ВызватьИсключение
                "Этот файл старее уже загруженных данных. "
                + "Выгрузите свежий файл из Бухгалтерии.";

        КонецЕсли;

    КонецЕсли;

    Если ТипЗнч(Данные.СуммаЗаявки) <> Тип("Число") Тогда
        ВызватьИсключение "Неверный тип суммы заявки.";
    КонецЕсли;

    Если Данные.СуммаЗаявки <> ДокументЗаявки.СуммаЗаявки Тогда

        ВызватьИсключение
            "Стоимость заявки в двух базах различается. "
            + "Сначала передайте актуальную заявку в Бухгалтерию, "
            + "затем сформируйте новый обратный файл.";

    КонецЕсли;

    // Проверяем массивы и идентификаторы до заполнения таблиц.
    ОбменБП_ПроверитьСтроки(
        Данные.Оплаты, "Оплаты");

    ОбменБП_ПроверитьСтроки(
        Данные.БухгалтерскиеДокументы,
        "Бухгалтерские документы");

    СуммаОплат = 0;

    Для Каждого Платеж Из Данные.Оплаты Цикл
        СуммаОплат = СуммаОплат + Платеж.Сумма;
    КонецЦикла;

    Если СуммаОплат <> Данные.СуммаОплаты Тогда
        ВызватьИсключение "Итог оплат не совпадает с суммой строк файла.";
    КонецЕсли;

    Если Данные.СуммаЗаявки - СуммаОплат
        <> Данные.ОстатокКОплате Тогда

        ВызватьИсключение "В файле неверно рассчитан остаток к оплате.";

    КонецЕсли;

    // Полная замена оплат данными Бухгалтерии.
    ДокументЗаявки.Оплаты.Очистить();

    Для Каждого Платеж Из Данные.Оплаты Цикл

        НоваяСтрока = ДокументЗаявки.Оплаты.Добавить();

        НоваяСтрока.ИдентификаторБП = Строка(
            Новый УникальныйИдентификатор(
                Платеж.ИдентификаторБП));

        НоваяСтрока.Дата =
            ОбменБП_ДатаИзСтроки(Платеж.Дата);

        НоваяСтрока.НомерДокумента = Платеж.НомерДокумента;
        НоваяСтрока.Сумма = Платеж.Сумма;
        НоваяСтрока.Комментарий = Платеж.Комментарий;

    КонецЦикла;

    // Полная замена списка бухгалтерских документов.
    ДокументЗаявки.БухгалтерскиеДокументы.Очистить();

    Для Каждого ДанныеДокумента
        Из Данные.БухгалтерскиеДокументы Цикл

        НоваяСтрока =
            ДокументЗаявки.БухгалтерскиеДокументы.Добавить();

        НоваяСтрока.ИдентификаторБП = Строка(
            Новый УникальныйИдентификатор(
                ДанныеДокумента.ИдентификаторБП));

        НоваяСтрока.Номер = ДанныеДокумента.Номер;
        НоваяСтрока.ВидДокумента = ДанныеДокумента.ВидДокумента;

        НоваяСтрока.Дата =
            ОбменБП_ДатаИзСтроки(ДанныеДокумента.Дата);

        НоваяСтрока.Сумма = ДанныеДокумента.Сумма;
        НоваяСтрока.Комментарий = ДанныеДокумента.Комментарий;

    КонецЦикла;

    ДокументЗаявки.ИдентификаторЗаявкиБП = ИдентификаторБП;
    ДокументЗаявки.ДатаОбменаБП = ДатаВыгрузки;

    ДокументЗаявки.СуммаОплаты =
        ДокументЗаявки.Оплаты.Итог("Сумма");

    ДокументЗаявки.СальдоКонечное =
        ДокументЗаявки.СуммаЗаявки
        - ДокументЗаявки.СуммаОплаты;

    // Изменяем форму только после успешного заполнения.
    ЗначениеВРеквизитФормы(ДокументЗаявки, "Объект");

    Возврат
        "Данные Бухгалтерии загружены. Документов: "
        + Строка(Данные.БухгалтерскиеДокументы.Количество())
        + "; оплат: " + Строка(Данные.Оплаты.Количество())
        + "; оплачено: " + Строка(СуммаОплат)
        + "; остаток: " + Строка(ДокументЗаявки.СальдоКонечное)
        + ". Проверьте результат и нажмите «Записать».";

КонецФункции


&НаСервереБезКонтекста
Процедура ОбменБП_ПроверитьСтроки(СтрокиJSON, НазваниеТаблицы)

    Если ТипЗнч(СтрокиJSON) <> Тип("Массив") Тогда

        ВызватьИсключение
            "Ожидается массив: " + НазваниеТаблицы;

    КонецЕсли;

    Идентификаторы = Новый Соответствие;

    Для Каждого ДанныеСтроки Из СтрокиJSON Цикл

        Идентификатор = Строка(
            Новый УникальныйИдентификатор(
                ДанныеСтроки.ИдентификаторБП));

        Если Идентификаторы.Получить(
            Идентификатор) <> Неопределено Тогда

            ВызватьИсключение
                "Повторяется идентификатор в таблице: "
                + НазваниеТаблицы;

        КонецЕсли;

        Идентификаторы.Вставить(Идентификатор, Истина);

        Если ТипЗнч(ДанныеСтроки.Сумма) <> Тип("Число") Тогда

            ВызватьИсключение
                "Неверный тип суммы в таблице: "
                + НазваниеТаблицы;

        КонецЕсли;

        Если ДанныеСтроки.Сумма < 0 Тогда

            ВызватьИсключение
                "Отрицательные суммы пока не поддерживаются: "
                + НазваниеТаблицы;

        КонецЕсли;

    КонецЦикла;

КонецПроцедуры


&НаСервереБезКонтекста
Функция ОбменБП_ДатаИзСтроки(ЗначениеJSON)

    Если ЗначениеJSON = Неопределено
        Или ЗначениеJSON = Null Тогда

        Возврат Дата(1, 1, 1);

    КонецЕсли;

    Если ТипЗнч(ЗначениеJSON) <> Тип("Строка") Тогда
        ВызватьИсключение "Дата должна быть строкой.";
    КонецЕсли;

    Если СтрДлина(ЗначениеJSON) <> 19 Тогда
        ВызватьИсключение "Неверный формат даты: " + ЗначениеJSON;
    КонецЕсли;

    Возврат Дата(
        Число(Сред(ЗначениеJSON, 1, 4)),
        Число(Сред(ЗначениеJSON, 6, 2)),
        Число(Сред(ЗначениеJSON, 9, 2)),
        Число(Сред(ЗначениеJSON, 12, 2)),
        Число(Сред(ЗначениеJSON, 15, 2)),
        Число(Сред(ЗначениеJSON, 18, 2)));

КонецФункции
// Отдел определяется выбранным логистом.
&НаКлиенте
Процедура ЛогистПриИзменении(Элемент)
    ЗаполнитьОтделЛогистаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтделЛогистаНаСервере()
    Если ЗначениеЗаполнено(Объект.Логист) Тогда
        Объект.Отдел = Объект.Логист.Отдел;
    Иначе
        Объект.Отдел = Справочники.Отделы.ПустаяСсылка();
    КонецЕсли;
КонецПроцедуры
